---
kind: other
id: Properties.T:Autodesk.Revit.DB.ComponentRepeater
source: html/c601ef62-9dfd-0933-32cf-b55f342d7064.htm
---
# ComponentRepeater Properties

The id of the assembly instance to which the element belongs.